<template>
    <div id="goodsService">
        <div id="goodDetail" class="pdt30" style="text-align: left">
            <p v-html="serviceHtml"></p>
        </div>
    </div>
</template>

<script>
    export default {
        name: "goodsService",
        components: {},
        props: ['id'],
        data() {
            return {
                serviceHtml:''
            }
        },
        mounted() {
            let serviceHtml = '<h2 style="color: #F56C6C">厂家服务</h2>' +
                '    <p>本商品质保周期为1年质保，在此时间范围内可提交维修申请，具体请以厂家服务为准。 如因质量问题或故障，凭厂商维修中心或特约维修点的质量检测证明，享受7日内退货，15日内换货，15日以上在质保期内享受免费保修等三包服务！' +
                '      (注:如厂家在商品介绍中有售后保障的说明,则此商品按照厂家说明执行售后保障服务。)</p>' +
                '    <h2 style="color: #F56C6C">砺锋承诺</h2>' +
                '    <p>砺锋商城平台卖家销售并发货的商品，由平台卖家提供发票和相应的售后服务。请您放心购买！' +
                '      注：因厂家会在没有任何提前通知的情况下更改产品包装、产地或者一些附件，本司不能确保客户收到的货物与商城图片、产地、附件说明完全一致。只能确保为原厂正货！并且保证与当时市场上同样主流新品一致。若本商城没有及时更新，请大家谅解！</p>' +
                '    <h2 style="color: #F56C6C">正品行货</h2>' +
                '    <p>砺锋商城向您保证所售商品均为正品行货，砺锋自营商品开具机打发票或电子发票。</p>' +
                '    <h2 style="color: #F56C6C">无忧退货</h2>' +
                '    <p>客户购买砺锋自营商品7日内（含7日，自客户收到商品之日起计算），在保证商品完好的前提下，可无理由退货。（部分商品除外，详情请见各商品细则）</p>' +
                '    <b style="color: #F56C6C">权利声明：</b><br/>' +
                '    <p>砺锋商城上的所有商品信息、客户评价、商品咨询、网友讨论等内容，是砺锋重要的经营资源，未经许可，禁止非法转载使用。</p>' +
                '    <p><b>注：</b>本站商品信息均来自于合作方，其真实性、准确性和合法性由信息拥有者（合作方）负责。本站不提供任何保证，并不承担任何法律责任。</p>' +
                '    <b style="color: #F56C6C">价格说明：</b><br/>' +
                '    <p><b>砺锋价：</b>砺锋价为商品的销售价，是您最终决定是否购买商品的依据。</p>' +
                '    <p><b>划线价：</b>商品展示的划横线价格为参考价，并非原价，该价格可能是品牌专柜标价、商品吊牌价或由品牌供应商提供的正品零售价（如厂商指导价、建议零售价等）或其他真实有依据的价格；由于地区、时间的差异性和市场行情波动，品牌专柜标价、商品吊牌价等可能会与您购物时展示的不一致，该价格仅供您参考。</p>' +
                '    <p><b>折扣：</b>如无特殊说明，折扣指销售商在原价、或划线价（如品牌专柜标价、商品吊牌价、厂商指导价、厂商建议零售价）等某一价格基础上计算出的优惠比例或优惠金额；如有疑问，您可在购买前联系销售商进行咨询。</p>' +
                '    <p><b>异常问题：</b>商品促销信息以商品详情页“促销”栏中的信息为准；商品的具体售价以订单结算页价格为准；如您发现活动商品售价或促销信息有异常，建议购买前先联系销售商咨询。</p>'
            this.serviceHtml = serviceHtml
        }
    }
</script>

<style scoped>

</style>
